app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @all_ratings = Movie.order(:rating).select(:rating).map(&:rating).uniq
    @checked_ratings = check
    @checked_ratings.each do |rating|
      params[rating] = true
    end
      @movies = Movie.order(params[:sort])